# ცვლადის სახელი არ უნდა იწყებოდეს ციფრით, ამიტომ შევცვალეთ user_1-ით
user_1 = 'Nika' # ბრჭყალები უნდა იყოს წყვილში (' ')

# აქაც ციფრი გადავიტანეთ ბოლოში
user_2 = "Lika" # აქ გამოვიყენეთ ორმაგი ბრჭყალები (" ")

# პითონი მგრძნობიარეა რეგისტრის მიმართ (Case-sensitive), 
# ამიტომ ცვლადი ზუსტად ისე უნდა ჩავწეროთ, როგორც ზემოთ (user_2)
print(user_2)

# მომხმარებელს ვთხოვთ მონაცემების შეყვანას
name = input("შეიყვანეთ სახელი: ")
surname = input("შეიყვანეთ გვარი: ")
address = input("შეიყვანეთ მისამართი: ")
age = input("შეიყვანეთ ასაკი: ")

# f-string-ის გამოყენებით ვსვამთ ცვლადებს ტექსტში
print(f'I am {name} {surname}, I live in {address} and I am {age} years old')


# ვინახავთ იმეილს და პაროლს ცვლადებში
email = input("შეიყვანეთ თქვენი ელ-ფოსტა: ")
password = input("შეიყვანეთ თქვენი პაროლი: ")

# გამოგვაქვს მიღებული ინფორმაცია
print("მომხმარებლის მონაცემები:")
print(f"Email: {email}")
print(f"Password: {password}")