# ==========================================
# 2) ცვლადის დეკლარირების 3 ცუდი პრაქტიკა:
# 1. გაუგებარი სახელები: მაგ. a, b, c (უმჯობესია: age, price, count).
# 2. რეზერვირებული სიტყვების გამოყენება: მაგ. print = 10 ან list = [1, 2].
# 3. არათანმიმდევრული სტილი: ერთ კოდში snake_case-ის და camelCase-ის არევა.
# ==========================================

# ==========================================
# 3) რა არის Debugging?
# დებაგინგი არის პროგრამულ კოდში შეცდომების (ბაგების) ძიების, იდენტიფიცირებისა და აღმოფხვრის პროცესი, რათა პროგრამამ იმუშაოს სწორად და ლოგიკურად
# ==========================================

# ==========================================
# 4) გავრცელებული Error-ები Python-ში:
# - SyntaxError: გრამატიკული შეცდომა კოდში.
# - NameError: არარსებული/გამოუცხადებელი ცვლადის გამოყენება.
# - TypeError: შეუსაბამო ტიპის მონაცემებზე ოპერაციის ჩატარება.
# - ValueError: ფუნქციისთვის შეუსაბამო მნიშვნელობის გადაცემა.
# - IndentationError: კოდის დაშორებების (ტაბულაციის) დარღვევა.
# ==========================================

# ==========================================
# 5) გასწორებული კოდები:

# 5.1
name = "Lika"
print(name)  # გასწორდა: namme -> name

# 5.2
number = 5
text = " apples"
result = str(number) + text # გასწორდა: ტიპების convartioni (int + str არ შეიძლება)
print(result)

# 5.3
name = "liKa" # გასწორდა: დაემატა ბრჭყალები
name2 = name + "4" # გასწორდა: naame -> name

# 5.4 & 5.6
first_user = "Lika"
user2 = "Giorgi" # გასწორდა: ცვლადი არ იწყება ციფრით (2nduser -> user2)
print(first_user) # გასწორდა: გამოტოვება შეიცვალა ქვედა ტირეით

# 5.5
first_name = "Data" # გასწორდა: დაემატა ქვედა ტირე და მნიშვნელობა სტრინგია
last_name = "random" # გასწორდა: სიმბოლო % არ დაიშვება სახელსი
# ==========================================



# ==========================================
# 7) 
city = input("შეიყვანეთ ქალაქი: ")
district = input("შეიყვანეთ უბანი: ")
building = input("შეიყვანეთ კორპუსის ნომერი: ")
floor = input("შეიყვანეთ სართული: ")

print(f"მისამართი: {city}, {district}, კორპუსი {building}, სართული {floor}.")
# ==========================================



# ==========================================
# 8) 
age = input("რამდენი წლის ხართ? ")
print(f"You are {age} years old.")
# ==========================================

# ==========================================
# 9) 
num1 = input("შემოიტანეთ პირველი რიცხვი: ")
num2 = input("შემოიტანეთ მეორე რიცხვი: ")


print("შედეგი:", num1 + num2)

# ახსნა:
# input() ფუნქცია ყოველთვის აბრუნებს სტრინგს (ტექსტს). 
# როდესაც ორ სტრინგს შორის ვიყენებთ "+", ხდება მათი გადაბმა (Concatenation) 
# და არა მათემატიკური შეკრება. მაგალითად: "5" + "10" მოგვცემს "510"-ს.
# ==========================================

print(type(0))